{
    "about": "Senior Engineering Manager with over 20 years of experience in building and leading high-performing technology teams. Passionate about fostering innovation, mentoring engineers, and delivering solutions that drive business value.",
    
    "experience": [
      {
        "title": "Senior Systems Engineering Manager",
        "company": "Cisco",
        "location": "Gretna,NE",
        "period": "2020 - Present",
        "description": "Leading a high-performing team of 8 engineers, I drive growth and adoption by aligning customer needs with cutting-edge collaboration solutions. Partnering with sales specialists, I bridge technical expertise with business outcomes to deliver impactful, customer-centric solutions that accelerate success."
      },
      {
        "title": "Technical Solutions Architect",
        "company": "Cisco",
        "location": "Omaha, NE",
        "period": "2017 - 2020",
        "description": "As a trusted advisor, I designed and delivered cutting-edge collaboration solutions, aligning technology with business needs to drive customer success. Partnering with sales teams, I translated complex technical requirements into strategic solutions, enabling seamless adoption and long-term value for customers."
      },
      {
        "title": "Consulting Systems Engineer - Collaboration",
        "company": "Cisco",
        "location": "Omaha, NE",
        "period": "2012 - 2017",
        "description": "Advising customers on innovative collaboration solutions, I bridged business needs with technical capabilities to drive seamless adoption. Working closely with stakeholders, I provided strategic guidance, solution design, and technical expertise to optimize collaboration experiences and deliver measurable business outcomes."
      }
    ],
    
    "skills": [
      "Technical Leadership",
      "Cross-functional Collaboration",
      "Strategic Business Alignment",
      "Customer-Centirc Selling",
      "Stakeholder & Relationship Management",
      "Data-Driven Decision Making",
      "Change Management & Adaptability",
      "Solution Architecture",
      "Cloud & Hybrid Expertise",
      "Security & Compliance"
    ],
    
    "Training": [
      {
        "name": "SE Manager/Director Development Program - SMDD",
        "year": "2024"
      },
      {
        "name": "SE Transitions & Leadership Development Program - STLDP",
        "year": "2018"
      }
    ],
    
    "education": [
      {
        "school": "University of Nebraska at Omaha"
      }
    ],
    
    "publications": [],
    
    "languages": []
  }
